Revit 2024 API
FormatOptions.CanUsePlusPrefix Method
 Checks whether a plus prefix can be displayed for the display unit in this FormatOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool CanUsePlusPrefix()
Visual Basic
Public Function CanUsePlusPrefix As Boolean
Visual C++
public:
bool CanUsePlusPrefix()
Return Value
 True if a plus prefix can be displayed, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
FormatOptions Class
CanUsePlusPrefix Overload
Autodesk.Revit.DB Namespace